## Lista to dataFrame Pandas

In [7]:
import pandas as pd

x=[['7089005','ARS',120.50],['7081222','USD',15000.75],['8555512','ARS',89000]]

In [8]:
lista_columnas=['cuenta','moneda','importe']
dataframe = pd.DataFrame(x,columns=lista_columnas)

In [9]:
dataframe

    cuenta moneda   importe
0  7089005    ARS    120.50
1  7081222    USD  15000.75
2  8555512    ARS  89000.00

In [10]:
dataframe['cuenta']

0    7089005
1    7081222
2    8555512
Name: cuenta, dtype: object

In [11]:
dataframe.to_csv('test.csv', index=False, header=False, sep='|', encoding='utf-8')

-----

In [39]:
import pandas as pd

lista_columnas=['cuenta','moneda','importe']
x = [[1,2,3]]
dataframe = pd.DataFrame(x,columns=lista_columnas)
dataframe

   cuenta  moneda  importe
0       1       2        3

In [41]:
df1=pd.DataFrame([[6,7,8]],columns=lista_columnas)
df2=pd.DataFrame([[3,4,5],[11,12,13]],columns=lista_columnas)

In [42]:
df_final = pd.concat([dataframe, df1,df2] , axis=0)
df_final

   cuenta  moneda  importe
0       1       2        3
0       6       7        8
0       3       4        5
1      11      12       13

----

In [67]:
import pandas as pd

x = [[0,500007, 15900.75],[12, 389,250333.12]]
lista_columnas=['sucu','cuenta','importe']
dataframe = pd.DataFrame(x,columns=lista_columnas)
dataframe

   sucu  cuenta    importe
0     0  500007   15900.75
1    12     389  250333.12

In [73]:
# calling method and overwriting series 
dataframe["sucu"]= dataframe["sucu"].astype(str).str.zfill(4)
dataframe["cuenta"]= dataframe["cuenta"].astype(str).str.zfill(10)
dataframe['full_name'] = 'CUE / ' + dataframe.sucu + ' - ' + dataframe.cuenta
dataframe

   sucu      cuenta    importe                full_name
0  0000  0000500007   15900.75  CUE / 0000 - 0000500007
1  0012  0000000389  250333.12  CUE / 0012 - 0000000389